.model tiny
.code
org 100h

locals @@


; =============================================================================
; CONSTANTS
; =============================================================================


; Функция 09h прерывания, отвечающая за ввод символа из терминала
KEYBOARD_INPUT      equ 01h
; Функция 09h прерывания, отвечающая за стандартный вывод строки, оканчивающейся на '$'
DISPLAY_STRING      equ 09h
; Ascii-код символа возврата коретки
CR                  equ 0Dh


; =============================================================================
; ENTRY POINT
; =============================================================================


Start:
        call Main

        mov ax, 4C00h
        int 21h


; =============================================================================
; FUNCTIONS
; =============================================================================


; -----------------------------------------------------------------------------
; PROC: Main
; -----------------------------------------------------------------------------
; Описание:
;       Вызов функций обработки пользовательского ввода и проверки совпадения пароля
; Входные параметры:
;       Нет
; Выходные параметры:
;       Нет
; Портящиеся регистры:
;       ax, si, di
; -----------------------------------------------------------------------------
Main PROC
        mov ah, DISPLAY_STRING
        mov dx, offset message_prompt
        int 21h
        call ReadInput

        call CheckPasswordCorrectness
        mov al, [is_password_ok]
        test al, al
        je @@password_mismatch

        mov ah, DISPLAY_STRING
        mov dx, offset message_ok 
        int 21h
        jmp @@done
@@password_mismatch:
        mov ah, DISPLAY_STRING
        mov dx, offset message_not_ok
        int 21h
@@done:
        ret  
Main ENDP


; -----------------------------------------------------------------------------
; PROC: ReadInput
; -----------------------------------------------------------------------------
; Описание:
;       Чтение пользовательского ввода в буфер
; Входные параметры:
;       input_buffer - Буфер для пользовательского ввода
; Выходные параметры:
;       input_buffer - Пользовательский ввод
; Портящиеся регистры:
;       Нет
; -----------------------------------------------------------------------------
ReadInput PROC
        push bp
        mov bp, sp
        push ax bx

        lea bx, [input_buffer]

@@loop:    
        mov ah, KEYBOARD_INPUT
        int 21h

        cmp al, CR
        je @@exit                         

        mov [bx], al
        inc bx
        jmp @@loop
@@exit:

        mov byte ptr [bx], '$'                     

        pop bx ax
        pop bp
        ret
ReadInput ENDP


; -----------------------------------------------------------------------------
; PROC: CompareStrings
; -----------------------------------------------------------------------------
; Описание:
;       Сравнение двух строк на совпадение. Возвращает: 
;       0, если строки равны;
;       1 - если первая строка больше второй;
;       2 - если вторая строка больше первой.
;       Под 'больше' подразумевается, что на несовпадающем символе Ascii-код
;       у первой строки больше.
; Входные параметры:
;       si - Первая строка
;       di - Вторая строка
; Выходные параметры:
;       ax - Результат сравнения
; Портящиеся регистры:
;       Нет
; -----------------------------------------------------------------------------
CompareStrings PROC
        push bp
        mov bp, sp
        push cx si di

        xor cx, cx
        mov cl, password_len
        cld
        repe cmpsb

        je @@string_equality
        ja @@first_line_greater

        mov ax, 2h
        jmp @@endif
@@first_line_greater:
        mov ax, 1h
        jmp @@endif
@@string_equality:
        xor ax, ax
@@endif:

        pop di si cx
        pop bp
        ret
CompareStrings ENDP


; -----------------------------------------------------------------------------
; PROC: CheckPasswordCorrectness
; -----------------------------------------------------------------------------
; Описание:
;       Проверка совпадения пользовательского ввода с эталонным паролем.
;       Возвращает:
;       1 - при совпадении.
; Входные параметры:
;       correct_password - Эталонный пароль
;       input_buffer     - Пользовательский ввод
;       is_password_ok   - Переменная для хранения результата совпадения паролей
; Выходные параметры:
;       is_password_ok   - Результат совпадения пароля
; Портящиеся регистры:
;       Нет
; -----------------------------------------------------------------------------
CheckPasswordCorrectness PROC
        push bp
        mov bp, sp
        push ax si di

        mov si, offset correct_password
        mov di, offset input_buffer
        call CompareStrings

        test ax, ax
        jne @@skip
        mov [is_password_ok], 1h
@@skip:

        pop di si ax
        pop bp
        ret
CheckPasswordCorrectness ENDP


; =============================================================================
; VARIABLES
; =============================================================================


; Буфер для пользовательского ввода
input_buffer        db 16d DUP(?)
; Переменная, отвечающая за корректность введенного пароля
is_password_ok      db 0h

; Корректный пароль
correct_password    db "funny_aboba$"
; Длина корректного пароля
password_len        db $ - correct_password

; Сообщение, побуждающее ввести пароль
message_prompt      db "Enter password:$"
; Сообщение при корректности введенного пароля
message_ok          db "Access granted$"
; Сообщение при некорректности введенного пароля 
message_not_ok      db "Access denied$"


end Start